``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_compute_instance_v2.dilmurat will be created
  + resource "openstack_compute_instance_v2" "dilmurat" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "g1.c8m20g1d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "f5b82cb0-03b4-44f0-8ce5-33f15c53f89b"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "dilmurat dedicated VM"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-ssh",
        ]
      + stop_before_destroy = false
      + user_data           = "5b7fdd43e65e904424ba7b54253f53b8c5e2a097"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.dilmurat-va will be created
  + resource "openstack_compute_volume_attach_v2" "dilmurat-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = "981a98dc-cc05-4ed9-9a2b-e3018ccd627d"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```